tutorials/compressibleDXIsoFlow/FocusedWaveOnPerforatedBreakwater/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
   (0.0     0.0   -1.0)
   (39.48   0.0   -1.0)
   (39.48   0.0   0.44)
   (0.0     0.0   0.44)
   (0.0     0.02  -1.0)
   (39.48   0.02  -1.0)
   (39.48   0.02  0.44)
   (0.0     0.02  0.44)
);

blocks          
(
    hex (0 1 5 4 3 2 6 7)   (658 1 90) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }    
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }  
    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    } 
    frontAndBack
    {
        type patch; // it should be empty, but adopting "patch" will accelerate the snappyHexMesh process 
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }     
);

mergePatchPairs
(
);

// ************************************************************************* //
