tutorials/compressibleDXIsoFlow/FocusedWaveOnPerforatedBreakwater/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    outlet 
    {
        type            zeroGradient;
    }
    inlet 
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    slope
    {
        type            zeroGradient;
    }
    PCB
    {
        type            zeroGradient;
    }
    atmosphere 
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
}

// ************************************************************************* //
