tutorials/compressibleDXIsoFlow/FocusedWaveOnPerforatedBreakwater/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    } 
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }   
    slope
    {
        type            nutkWallFunction;
        value           uniform 0;
    } 
    PCB
    {
        type            nutkWallFunction;
        value           uniform 0;
    }     
    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
